In [7]:
import pandas as pd
data=pd.read_excel("dataa.xlsx",skiprows=1)
data

  GOOGL             27    87  laary page   64
0   WMT            5.4    65         n.a   33
1  MSKT             -1    64  nbillgates   22
2   RIL  not available  1023      mukesh   11
3  TATA              9   n.a        rtab  n.a

In [12]:
data=pd.read_excel("dataa.xlsx",nrows=3)
data

  tickets   eps  revenue      people  price
0   GOOGL  27.0       87  laary page     64
1     WMT   5.4       65         n.a     33
2    MSKT  -1.0       64  nbillgates     22

In [13]:
data=pd.read_excel("dataa.xlsx",na_values=["not available","n.a"])
data

  tickets   eps  revenue      people  price
0   GOOGL  27.0     87.0  laary page   64.0
1     WMT   5.4     65.0         NaN   33.0
2    MSKT  -1.0     64.0  nbillgates   22.0
3     RIL   NaN   1023.0      mukesh   11.0
4    TATA   9.0      NaN        rtab    NaN

In [15]:
data.to_excel("new.xlsx",index=False)

In [16]:
data.columns

Index(['tickets', 'eps', 'revenue', 'people', 'price'], dtype='object')

In [17]:
data.to_excel("new.xlsx",columns=["tickets","eps"])

In [18]:
data

  tickets   eps  revenue      people  price
0   GOOGL  27.0     87.0  laary page   64.0
1     WMT   5.4     65.0         NaN   33.0
2    MSKT  -1.0     64.0  nbillgates   22.0
3     RIL   NaN   1023.0      mukesh   11.0
4    TATA   9.0      NaN        rtab    NaN